import React from "react";
import Rating from "./Rating";

import photo1 from "../images/person1.jpeg";
import photo2 from "../images/person2.jpeg";
import photo3 from "../images/person3.jpg";
import photo4 from "../images/person4.jpg";
import photo5 from "../images/person5.jpeg";
import photo6 from "../images/person6.jpeg";
import photo7 from "../images/person7.jpeg";

const Ratings = () => {
  const ratings = [
    {
      id: 1,
      photo: photo1,
      name: "Darin Bguyen",
      txt: "تصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان على تقييم الموظف. تصفح على موقع فرصة ",
    },
    {
      id: 2,
      photo: photo2,
      name: "Darin Bguyen",
      txt: "تصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقعتصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقع فرصة",
    },
    {
      id: 3,
      photo: photo3,
      name: "Darin Bguyen",
      txt: "تصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقع فرصة ",
    },
    {
      id: 4,
      photo: photo4,
      name: "Darin Bguyen",
      txt: "تصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقعتصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقع فرصة",
    },
    {
      id: 5,
      photo: photo5,
      name: "Darin Bguyen",
      txt: "تصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقعتصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقع فرصة",
    },
    {
      id: 6,
      photo: photo6,
      name: "Darin Bguyen",
      txt: "تصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقعتصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الزيادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقع فرصة",
    },
    {
      id: 7,
      photo: photo7,
      name: "Darin Bguyen",
      txt: "تصدر أغلب الشركات تقريرًا منتظمًا بتقييم موظفيها ومراجعة أدائهم الوظيفي. غالبًا ما يقدم هذا التقرير إما شهريًا أو سنويًا أو بمرور عام على التوظيف. وفي بعض الأحيان تتوقف الز موقع فرصة في العمل على تقييم  يادة السنوية أو حتى الاستمرار في العمل على تقييم الموظف. تصفح على موقع فرصة  في العمل على تقييم الموظف. تصفح على موقع",
    },
  ];

  const result1 = ratings.map((el) => {
    if (el.id % 2) {
      return (
        <Rating key={el.id} photo={el.photo} name={el.name} txt={el.txt} />
      );
    }
    return null;
  });

  const result2 = ratings.map((el) => {
    if (el.id % 2 === 0) {
      return (
        <Rating key={el.id} photo={el.photo} name={el.name} txt={el.txt} />
      );
    }
    return null;
  });

  return (
    <div className="ratings">
      <h1 className="title-dashboard">التقييمات</h1>
      <div className="boxes">
        <div>{result1}</div>
        <div>{result2}</div>
      </div>
    </div>
  );
};

export default Ratings;
